# 1. 아래와 같은 DataFrame 을 만드시오.

| d | su | val |
|:-----:|:-----:|:-----:|
| 2 | 1 | 2 |
| 2 | 2 | 4 |
| . | . | . |
| 9 | 9 | 81 |

(o) 'row 를 concat 하는 방식'<BR>
(x) Series 를 만들어 col 추가<BR>
(x) CSV 로드

In [1]:
import pandas as pd

In [2]:
pdata = pd.DataFrame(columns = ["d","su","val"])
pdata

Empty DataFrame
Columns: [d, su, val]
Index: []

In [3]:
for i in range(2,10):
  for i2 in range(1,10):
    print(i, i2, i*i2)

2 1 2
2 2 4
2 3 6
2 4 8
2 5 10
2 6 12
2 7 14
2 8 16
2 9 18
3 1 3
3 2 6
3 3 9
3 4 12
3 5 15
3 6 18
3 7 21
3 8 24
3 9 27
4 1 4
4 2 8
4 3 12
4 4 16
4 5 20
4 6 24
4 7 28
4 8 32
4 9 36
5 1 5
5 2 10
5 3 15
5 4 20
5 5 25
5 6 30
5 7 35
5 8 40
5 9 45
6 1 6
6 2 12
6 3 18
6 4 24
6 5 30
6 6 36
6 7 42
6 8 48
6 9 54
7 1 7
7 2 14
7 3 21
7 4 28
7 5 35
7 6 42
7 7 49
7 8 56
7 9 63
8 1 8
8 2 16
8 3 24
8 4 32
8 5 40
8 6 48
8 7 56
8 8 64
8 9 72
9 1 9
9 2 18
9 3 27
9 4 36
9 5 45
9 6 54
9 7 63
9 8 72
9 9 81

In [4]:
for i in range(2,10):
  for i2 in range(1,10):
    data = pd.DataFrame([[i,i2,i*i2]],columns = ["d","su","val"])
    pdata = pd.concat([pdata,  data],axis=0, join='inner')
pdata

    d su val
0   2  1   2
0   2  2   4
0   2  3   6
0   2  4   8
0   2  5  10
.. .. ..  ..
0   9  5  45
0   9  6  54
0   9  7  63
0   9  8  72
0   9  9  81

[72 rows x 3 columns]

# 2. a 가 NaN 일때 b 를 0 으로 바꾸기

|   | a | b |
|:-----:|:-----:|:-----:|
|  | 11 | 22 |
|  | NaN | 44 |

- tips. np.isnan() 함수를 활용하세요.
- tips2. (np.nan == 데이터) 는 동작하지 않습니다.
- tips3. rp[1], a
- tips4. df.iterrow() 를 활용하면 더 쉽습니다.

## 기본방법

In [5]:
import pandas as pd
import numpy as np

In [6]:
pdata = pd.DataFrame([[11., 22.],[np.nan, 44.]], columns = ["a","b"])
pdata

      a     b
0  11.0  22.0
1   NaN  44.0

In [7]:
for i in pdata.iterrows():
  if ( np.isnan(i[1]["a"])):
    i[1]["b"] = 0

In [8]:
pdata

      a     b
0  11.0  22.0
1   NaN   0.0

## 한줄로 처리하기

In [9]:
pdata2 = pd.DataFrame([[11., 22.],[np.nan, 44.]], columns = ["a","b"])
pdata2

      a     b
0  11.0  22.0
1   NaN  44.0

In [10]:
pdata2["b"]=[  r[1].b if not np.isnan(r[1].a) else 0 for r in pdata2.iterrows()]
pdata2

      a     b
0  11.0  22.0
1   NaN   0.0